pr-preview/pr-34/2026.07.14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="2026.07.07.html">先週号</a> <a href="index.html">上へ</a> <a href="2026.07.21.html">次週号</a>
</p>

<p>
こんにちは
</p>

<p>
2026年7月7日から14日までの週の OCaml Weekly News をお届けします。
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">opam 2.5.2</a></li>
<li><a href="#2">ocaml-wire: EverParse 3D 出力を持つバイナリワイヤーフォーマット DSL</a></li>
<li><a href="#3">Caqti 3.0.0</a></li>
<li><a href="#4">ocgtk 0.1: GTK 4 向け OCaml バインディング（プレビューリリース）</a></li>
<li><a href="#org5844e52">過去の CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">opam 2.5.2</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-opam-2-5-2/18338/1">https://discuss.ocaml.org/t/ann-opam-2-5-2/18338/1</a>
</p>
</div>

<div id="outline-container-org0ccf6ed" class="outline-3">
<h3 id="org0ccf6ed">Kate が発表しました</h3>
<div class="outline-text-3" id="text-org0ccf6ed">
<p>
皆さん、こんにちは。
</p>

<p>
opam 2.5.2 が公開されました。このリリースでは以下の問題が修正されています：
</p>
<ul class="org-ul">
<li>セキュリティ上の問題（<a href="https://github.com/ocaml/security-advisories/blob/main/advisories/2026/OSEC-2026-10.md">OSEC-2026-10</a>）</li>
<li>dune を使用するクロスコンパイルパッケージが正しくインストールできない 2.5.1 からのリグレッション（<a href="https://github.com/ocaml/dune/issues/14393">ocaml/dune#14393</a>）</li>
</ul>

<p>
できるだけ早く 2.5.2 へのアップグレードをお勧めします。
</p>

<p>
お使いのディストリビューションの古い opam パッケージに依存している場合、Debian Stable などのディストリビューションのメンテナーには既に通知済みであり、関連する修正のバックポートが近いうちに提供される予定です。
</p>

<p>
詳細とリンクについては、<a href="https://opam.ocaml.org/blog/opam-2-5-2/">ブログ記事</a>をご覧ください。
</p>
</div>

<div id="outline-container-org1925932" class="outline-4">
<h4 id="org1925932">お試しください！</h4>
<div class="outline-text-4" id="text-org1925932">
<p>
アップグレードの手順は変わりません：
</p>

<p>
Unix システムの場合：
</p>
<pre class="example" id="org1057dc6">
bash -c "sh &lt;(curl -fsSL https://opam.ocaml.org/install.sh) --version 2.5.2"
</pre>
<p>
または Windows の PowerShell から：
</p>
<pre class="example" id="org82a3551">
Invoke-Expression "&amp; { $(Invoke-RestMethod https://opam.ocaml.org/install.ps1) } -Version 2.5.2"
</pre>
<p>
問題が発生した場合は、<a href="https://github.com/ocaml/opam/issues">バグトラッカー</a>にご報告ください。
</p>

<p>
Happy hacking,
&lt;&gt; &lt;&gt; The opam team &lt;&gt; &lt;&gt; :camel:
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">ocaml-wire: EverParse 3D 出力を持つバイナリワイヤーフォーマット DSL</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-wire-a-binary-wire-format-dsl-with-everparse-3d-output/18009/4">https://discuss.ocaml.org/t/ann-ocaml-wire-a-binary-wire-format-dsl-with-everparse-3d-output/18009/4</a>
</p>
</div>

<div id="outline-container-org929f474" class="outline-3">
<h3 id="org929f474">このスレッドの続きとして、Thomas Gazagnaire が発表しました</h3>
<div class="outline-text-3" id="text-org929f474">
<p>
<code>ocaml-wire</code> 1.0.0 が opam に登録され、<code>opam install wire</code> でインストールできるようになりましたことをお知らせします。
</p>

<p>
このリリースでは、前バージョンからの堅牢性の修正と API のクリーンアップが行われています（そのため 1.0.0 というタグが付いています）。また、OCaml のパーサー/シリアライザーと生成された検証済み C パーサーの間での差分テストが大幅に追加されました。両者はランダムに生成されたスキーマとランダムな入力バイト列に対して実行され、テストでは受け入れるまたは拒否する内容、およびデコードした値が一致するかどうかを確認します。不一致が見つかった場所にはすべてバグがあり、現在はすべて修正されているようです。
</p>

<blockquote>
<p>
しかし、これらを符号付き整数や浮動小数点数としてどのように解釈するのでしょうか？それは上位レイヤーに任されているのでしょうか？
</p>
</blockquote>

<p>
EverParse 3D には符号付きや浮動小数点型はなく、符号なし整数のみです。したがって C バリデーターにとって int8 は UINT8 であり、float64 は UINT64 です。OCaml デコーダーが再解釈を行います。符号付き型には 2 の補数、浮動小数点には IEEE 754 を使用し、プレーンなフィールドに対しては両側があらゆるビットパターンを受け入れます。フィールドへの制約（ユーザーが DSL 経由で追加したもの）は、その投影を経ても有効でなければなりません。符号付きの順序制約は、C バリデーターに到達する前に 2 の補数の等価式に書き換える必要があります。なぜなら、符号ビットが立っているバイトに対して素朴な符号なし比較を行うと結果が異なるからです（バイト 200 は符号付きの値 -56 であり、OCaml では受け入れられますが、素朴な C の境界では拒否されます）。浮動小数点の有限性（<code>is_finite</code>、<code>is_nan</code>）は指数ビットへのテストにコンパイルされ、忠実な符号なし表現を持たない浮動小数点の順序制約は事前に拒否されます。この差分ファジングによって符号ビットの不一致が明らかになり、0.9 から 1.0 の間でこれらすべてが強化されました。
</p>

<p>
ゼロコピー読み取りも安全になりました。<code>Codec.validate</code> は <code>Codec.decode</code> が行うすべてのチェック（enum のメンバーシップ、境界、パディング、<code>where</code> 節）を強制するようになったため、信頼できない入力を検証してからゼロコピーの <code>Codec.get</code> 呼び出しのバッチを行う場合、デコーダーが拒否したであろうバイトを信頼することがなくなりました（こちらも差分テストで検出されました）。
</p>

<p>
生成された <code>.3d</code> ファイルもプロトコルの仕様書として非常に読みやすいことが判明しました。ひとつの codec ファミリー全体が単一の .3d ファイルに射影され、その .3d ファイルは仕様書としても機能し、FFI なしのスタンドアロンな検証済み C パーサーにコンパイルされます。TCP/IP スタックはよい比較例です：<a href="https://github.com/parsimoni-labs/ocaml-wire/blob/main/examples/net/net.ml">OCaml の定義</a>と<a href="https://github.com/parsimoni-labs/ocaml-wire/blob/main/examples/net/Net.3d">生成された 3d ファイル</a>をご覧ください。
</p>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">Caqti 3.0.0</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-caqti-3-0-0/18335/1">https://discuss.ocaml.org/t/ann-caqti-3-0-0/18335/1</a>
</p>
</div>

<div id="outline-container-org411e243" class="outline-3">
<h3 id="org411e243">Petter A. Urkedal が発表しました</h3>
<div class="outline-text-3" id="text-org411e243">
<p>
<a href="https://github.com/paurkedal/ocaml-caqti/">Caqti</a> 3.0.0 のリリースをお知らせします。このリリースでは、階層的モジュールへの移行を含むいくつかの破壊的変更が含まれています。Caqti 3 の API は主に <code>caqti.template</code> プレビューライブラリと Caqti 2 API の残りのモジュールの再編成です。
</p>

<p>
リリースノート：
</p>

<ul class="org-ul">
<li><code>caqti</code> ライブラリには Caqti 3 API が含まれ、<code>caqti.classic</code>
には Caqti 2 互換ラッパーが含まれます。Caqti 2 API のユーザーは、
リンク行に <code>caqti.classic</code> を追加する必要があります。Caqti 3 API
の早期採用者は <code>caqti.template</code> を <code>caqti</code> に置き換え、一部の
モジュールパスを調整する必要があります。新しい API への移行が推奨されますが、
既存アプリケーションに対しては段階的に行うことができます。</li>

<li>行のフォーマット時の先頭のカンマを修正しました。
<code>Caqti_type.pp_value</code>（Caqti 2）および <code>Caqti.Template.Row.pp</code>（Caqti 3）に影響します。</li>

<li><a href="https://github.com/paurkedal/ocaml-caqti/issues/140">issue #140</a> により、
<code>caqti-dynload</code> パッケージの非推奨化を保留しました。</li>

<li>SQLite では外部キー制約がデフォルトで有効になりました。</li>
</ul>

<p>
opam でリリースしているプロジェクトは、次回リリース前にリンク行に <code>caqti.classic</code> を追加する（または API を移行する）こと、および必要に応じて caqti の下限を 2.3.0 に引き上げること（<a href="https://discuss.ocaml.org/t/ann-caqti-2-3-0/17985">前回のお知らせ</a>を参照）をお勧めします。
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">ocgtk 0.1: GTK 4 向け OCaml バインディング（プレビューリリース）</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocgtk-0-1-ocaml-bindings-for-gtk-4-preview-release/17944/6">https://discuss.ocaml.org/t/ann-ocgtk-0-1-ocaml-bindings-for-gtk-4-preview-release/17944/6</a>
</p>
</div>

<div id="outline-container-orge184bee" class="outline-3">
<h3 id="orge184bee">このスレッドの続きとして、Chris Armstrong が発表しました</h3>
<div class="outline-text-3" id="text-orge184bee">
<p>
<b><b>ocgtk 0.1-preview2 が opam で公開されました</b></b>
</p>

<p>
このリリースでは生成される機能の量が大幅に増加し、生成ライブラリ（GTK、Gio、Pango、Cairo、GDK、GDKpixbuf、Graphene）で利用可能なクラスとメソッドの大部分をカバーしています。
</p>
</div>

<div id="outline-container-org70b6c97" class="outline-4">
<h4 id="org70b6c97">主な変更点</h4>
<div class="outline-text-4" id="text-org70b6c97">
</div>
<ul class="org-ul">
<li><a id="org1a26558"></a>シグナルサポートの拡張<br />
<div class="outline-text-5" id="text-org1a26558">
<p>
複数のパラメーターを持つシグナルと boolean 以外の戻り値パラメーターをもつシグナルがサポートされるようになり、サポートされるシグナル型の約 2/3 をカバーします。
</p>
</div>
</li>

<li><a id="orgc80f778"></a>GValue サポート<br />
<div class="outline-text-5" id="text-orgc80f778">
<p>
GValue が適切なシグナルサポートの前提条件として正しくサポートされるようになりました。
</p>
</div>
</li>

<li><a id="org82134d2"></a>プリミティブサポートの拡張<br />
<div class="outline-text-5" id="text-org82134d2">
<p>
整数型の完全なカバレッジ、リスト型、配列処理の改善、GError から result 型へのマッピング、GObject の等価性とハッシュの改善。これらにより、生成可能なサポート対象メソッドのカバレッジが拡張されます。
</p>
</div>
</li>

<li><a id="org10526a6"></a>メモリ管理<br />
<div class="outline-text-5" id="text-org10526a6">
<p>
メモリ管理のバグ、特に boxed レコード型に関するバグの修正に多大な労力が注がれました。boxed レコード型では、参照を扱うための一貫した GLib メカニズムが使用されるようになりました。
</p>
</div>
</li>

<li><a id="org048f175"></a>対応 OS およびコンパイラーバージョンの拡張<br />
<div class="outline-text-5" id="text-org048f175">
<p>
コード生成にのみ必要だった ocgtk の依存関係のほとんどが削除されたことで、Windows（MSYS2 のみ）および OCaml 4.14 までのバージョンへのサポートが拡張されました。
</p>
</div>
</li>

<li><a id="orgab855aa"></a>その他の改善<br />
<div class="outline-text-5" id="text-orgab855aa">
<ul class="org-ul">
<li>内部モジュール名を短縮することで、相互に依存するクラスとインターフェースをより適切に処理</li>
<li>クラスのコンストラクター生成：これにより、トップレベルでのクラスのエイリアス定義が不要になり、クラス型とコンストラクターのみを公開できるようになります。また、使用されないコードの除去が改善され、コンパイルのボトルネックが削減されます。</li>
</ul>

<p>
次のリリースでは、API ドキュメント生成の改善、レコードサポートのギャップや他のプリミティブ（定数、関数、コールバックなど）の対応に注力する予定です。
</p>
</div>
</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org5844e52" class="outline-2">
<h2 id="org5844e52">過去の CWN</h2>
<div class="outline-text-2" id="text-org5844e52">
<p>
CWN を見逃した場合は、<a href="mailto:alan.schmitt@polytechnique.org">メッセージを送っていただければ</a>メールでお送りします。また、<a href="https://ocaml.jp/cwn-ja/">アーカイブ</a>や<a href="https://ocaml.jp/cwn-ja/cwn.rss">RSS フィード</a>もご覧いただけます。
</p>

<p>
毎週メールで受け取りたい場合は、<a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a> を購読してください。
</p>

<div class="authorname" id="org541670b">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>